
use db_project_app

create table Employees
(
	Код_сотрудника int identity(1,1) not null primary key,
	Фамилия nvarchar(50),
	Имя nvarchar(50),
	Отчество nvarchar(50),
	email nvarchar(50)
)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



create table Сustomers
(
	код_заказчика int identity(1,1) not null primary key,
	название_компании_заказчика nvarchar(50)
)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



create table Doer
(
	код_исполнителя int identity(1,1) not null primary key,
	название_компании_исполнителя nvarchar(50)
)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

create table Projects
(
	Код_проекта int identity(1,1) not null primary key,
	Название_проекта nvarchar(50),
	код_заказчика int foreign key references Сustomers(код_заказчика),
	код_исполнителя int foreign key references Doer(код_исполнителя),
	Дата_Начала_проекта date,
	Дата_окончания_проекта date,
	Приоритет_проекта int
)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

--ведется учет кто работает с каким проектом и на какой роли
create table RecordsPrEm
(
	код_назначения int identity(1,1) not null primary key,
	Код_проекта int foreign key references Projects(Код_проекта),
	Код_сотрудника int foreign key references Employees(Код_сотрудника),
	роль_сотрудника int
)